# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

a = input("String: ")
b = input("Str: ")

print(a.count(b))
